#ifndef _SDK_H
#define _SDK_H

#include <stdint.h>
#include "FollowLine.h"

//T432 API接口

//T432速度控制
/*
       (+X)
        |
        |
(-Y)---------(+Y)
        |
        |
       (-X)


Speed:
控制飞机横纵方向速度

//起飞命令
T432_API_Speed(CmdTakeOff,0,0);

//降落命令
T432_API_Speed(CmdLand,0,0);

飞机向左边飞行，我们建议速度不超过30
T432_API_Speed(CmdSpeeedControl,0,20);
*/

typedef struct
{
    float data_temp[20];
    uint8_t length;
    float s2;
}s2_t;

typedef struct
{
    uint8_t sdk_alt_step;
    uint8_t sdk_yaw_step;
    float sdk_yaw_d_angle;
    uint16_t sdk_yaw_angle_count;
    float sdk_alt_out;
    float sdk_velocity_x;
    float sdk_velocity_y;
    bool sdk_auto_takeoff;

    //进行速度积分，得出粗略位置
    float location_x;
    float location_y;

    float yaw_mark;
    float *yaw_pos_ptr;
} sdk_manager_t;

extern sdk_manager_t sdk_manager;

#define MAX_SPEED 30

/******************************************************************************
  * 函数名称：sdk_init
  * 函数描述：sdk的初始化
  * 输    入：void
  * 输    出：void
  * 返    回：void 
  * 备    注：null    
  *    
  *
******************************************************************************/
void sdk_init(void);

/******************************************************************************
  * 函数名称：sdk_yaw_set
* 函数描述：使用sdk对无人机进行转角飞行
  * 输    入：void
  * 输    出：void
  * 返    回：void 
  * 备    注：void
******************************************************************************/
void sdk_yaw_set(float angle);
void sdk_target_set(float x_pos, float y_pos, float velocity_x, float velocity);


/******************************************************************************
  * 函数名称：sdk_velocity_set
  * 函数描述：使用sdk修改期望水平速度期望值
  * 输    入：float x float y表示水平速度方向和大小
  * 输    出：void
  * 返    回：void 
    * 备    注：速度参考方向可以按照此图来进行，一般来说，速度绝对值设定在20即可完成大部分程控赛题
  *
  *
******************************************************************************/
void sdk_velocity_set(float x, float y);

/******************************************************************************
  * 函数名称：sdk_round_set
* 函数描述：使用sdk对围绕某一半径做圆形运动，相当于绕杆飞行，飞行时，无人机机头对准杆
  * 输    入：float distance, float angle, uint8_t R_
distance：表示圆形运动的半径
float angle：表示运行的角度
uint8_t R_：表示左转还是右转，如果R大于0，则俯视下无人机绕杆逆时针旋转，如果R小于0，则俯视下无人机绕杆顺时针旋转
  * 输    出：void
  * 返    回：void 
  * 备    注：void
******************************************************************************/
void sdk_round_set(float distance, float angle, uint8_t R_);

/******************************************************************************
  * 函数名称：sdk_alititude_set
  * 函数描述：使用sdk修改期望高度值
  * 输    入：void
  * 输    出：void
  * 返    回：void 
    * 备    注：暂不开放
  *    
  *
******************************************************************************/
void sdk_alititude_set(float distance);

/******************************************************************************
  * 函数名称：sdk_takeoff
  * 函数描述：使用sdk进行无人机的起飞工作，包含自动解锁等内容
  * 输    入：alitude  自动起飞后的飞行高度
  * 输    出：void
  * 返    回：void 
  * 备    注：注意安全，谨慎使用    
  *    
  *
******************************************************************************/
void sdk_takeoff(float alititude);

/******************************************************************************
  * 函数名称：sdk_land
  * 函数描述：使用sdk进行无人机的降落工作，包含自动上锁等内容
  * 输    入：void
  * 输    出：void
  * 返    回：void 
  * 备    注：注意安全，谨慎使用    
  *    
  *
******************************************************************************/
void sdk_land(void);

/******************************************************************************
  * 函数名称：sdk_lock
* 函数描述：使用sdk对无人机进行上锁
  * 输    入：void
  * 输    出：void
  * 返    回：void 
  * 备    注：void
******************************************************************************/
void sdk_lock(void);

/******************************************************************************
  * 函数名称：sdk_unlock
* 函数描述：使用sdk对无人机进行解锁
  * 输    入：void
  * 输    出：void
  * 返    回：void 
  * 备    注：void
******************************************************************************/
void sdk_unlock(void);

/******************************************************************************
  * 函数名称：sdk_velociyt_y_set
* 函数描述：设定Y轴的速度值
* 输    入：float y 表示Y轴的速度设定值
  * 输    出：void
  * 返    回：void 
* 备    注：单独设定y轴的速度值
******************************************************************************/
void sdk_velociyt_y_set(float y);

/******************************************************************************
  * 函数名称：sdk_velociyt_x_set
  * 函数描述：设定X轴的速度值
  * 输    入：float X 表示Y轴的速度设定值
  * 输    出：void
  * 返    回：void
  * 备    注：单独设定x轴的速度值
******************************************************************************/
void sdk_velociyt_x_set(float x);

/******************************************************************************
  * 函数名称：sdk_update
  * 函数描述：使用sdk进行数据更新操作
  * 输    入：float dt 单位运行时间
  * 输    出：void
  * 返    回：void 
* 备    注：该任务已经挂在kernel任务列表下执行，不需要进行更改，如果您已经知道您
    *更改的内容，则可以进行尝试
  *    
  *
******************************************************************************/
void sdk_update(float dt);

/******************************************************************************
  * 函数名称：is_yaw_set_compleate
* 函数描述：确认是否YAW轴的转动已经结束
* 输    入：void
  * 输    出：void
  * 返    回：void 
* 备    注：yaw的转动需要时间，此函数用以确认yaw的转动是否结束
******************************************************************************/
bool is_yaw_set_compleate(void);

/******************************************************************************
  * 函数名称：sdk_yaw_little
* 函数描述：让飞机旋转微小的yaw角，适用于0.5度之间
* 输    入：void
  * 输    出：void
  * 返    回：void 
* 备    注：void
******************************************************************************/
void sdk_yaw_little(float yaw);

/******************************************************************************
  * 函数名称：sdk_yaw_stop
* 函数描述：停止yaw角转动
* 输    入：void
  * 输    出：void
  * 返    回：void 
* 备    注：相当于让飞机重新归位
******************************************************************************/
void sdk_yaw_stop(void);
void sdk_reset_Location(void);

/******************************************************************************
  * 函数名称：sdk_velocity_reset
* 函数描述：重置水平速度
  * 输    入：void
  * 输    出：void
  * 返    回：void 
* 备    注：相当于让飞机空中悬停静止
******************************************************************************/
void sdk_velocity_reset(void);

/******************************************************************************
  * 函数名称：sdk_yaw_reset
* 函数描述：重置yaw角
* 输    入：void
  * 输    出：void
  * 返    回：void 
* 备    注：相当于让飞机重新归位
******************************************************************************/
void sdk_yaw_reset(void);

/******************************************************************************
  * 函数名称：is_pos_n_set_compleate
  * 函数描述：判断位置是否飞行完成
  * 输    入：void
  * 输    出：void
  * 返    回：void 
  * 备    注：
******************************************************************************/
typedef enum
{
    sdk_alt = 0,
    // sdk_velocity_x,
    // sdk_velocity_y,
    sdk_pos_x,
    sdk_pos_y,

    sdk_pid_list,
} sdk_pid_list_t;
bool is_pos_y_set_compleate(float max_err);
bool is_pos_x_set_compleate(float max_err);
bool is_pos_set_compleate(float max_err);
void sdk_pos_set(float x,float y);
void sdk_update_position(void);
void sdk_reset_position(void);
extern PIDInfo_t sdk_pid[sdk_pid_list];
#endif
